run/3DmultiRegionDuineveldRisingBubble/baseMeshes/meshA/0/curvature
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      curvature;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    space
    {
        type            calculated;
        value           uniform 0;
    }
    interface
    {
        type            calculated;
        value           nonuniform List<scalar> 
3750
(
4000.000149269667
3999.99998582304
4000.000026286151
4000.00006829581
3999.999960618585
4000.000083534074
4000.000052192647
3999.999899334078
...
)
;
    }
}


// ************************************************************************* //
