run/3DmultiRegionDuineveldRisingBubble/baseMeshes/meshA/constant/mixtureProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mixtureProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryReader foamChemistryReader;

foamChemistryFile "$FOAM_CASE/constant/reactions";

transferSpecies ("A"); //Identify transfer species across interface

A
{
    He               He   [0 0 0 0 0 0 0] 0.033333333;
    DFluidA          DFluidA   [0 2 -1 0 0 0 0] 3.1e-07;
    DFluidB          DFluidB [ 0 2 -1 0 0 0 0 ] 3.1e-05;
}

B
{
    He               He   [0 0 0 0 0 0 0] 0.0;
    DFluidA          DFluidA   [0 2 -1 0 0 0 0] 3.1e-07; //Sc=100
    DFluidB          DFluidB [ 0 2 -1 0 0 0 0 ] 0.0;
}

P
{
    He               He   [0 0 0 0 0 0 0] 0;
    DFluidA          DFluidA   [0 2 -1 0 0 0 0] 3.1e-07;
    DFluidB          DFluidB [ 0 2 -1 0 0 0 0 ] 0.0;
}

SP
{
    He               He   [0 0 0 0 0 0 0] 0;
    DFluidA          DFluidA   [0 2 -1 0 0 0 0] 3.1e-07;
    DFluidB          DFluidB [ 0 2 -1 0 0 0 0 ] 0.0;
}

// ************************************************************************* //

