run/3DmultiRegionDuineveldRisingBubble/baseMeshes/meshA/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //




// bubble radius

// domain length in x,y-direction as multiple of radius

// number of cells in circumferential direction (must be divisible by 4!)

// number of cells per bubble diameter

// cell grading in outer domain (value bigger than 1)







 





//convertToMeters 0.001; // in mm

geometry
{
    sphereIn
    {
        type searchableSphere;
        centre (0 0 0);
        radius 1.0;
    }

    sphereOut
    {
        type searchableSphere;
        centre (0 0 0);
        radius 8;
    }
}

vertices
(
    (0.577350269189626 -0.577350269189626 -0.577350269189626) //0
    (4.61880215351701 -4.61880215351701 -4.61880215351701)
    (4.61880215351701 4.61880215351701 -4.61880215351701)
    (0.577350269189626 0.577350269189626 -0.577350269189626) //3
    (-0.577350269189626 0.577350269189626 -0.577350269189626)
    (-4.61880215351701 4.61880215351701 -4.61880215351701)
    (-4.61880215351701 -4.61880215351701 -4.61880215351701)
    (-0.577350269189626 -0.577350269189626 -0.577350269189626)  //7
    (0.577350269189626 -0.577350269189626 0.577350269189626)
    (4.61880215351701 -4.61880215351701 4.61880215351701)
    (4.61880215351701 4.61880215351701 4.61880215351701)
    (0.577350269189626 0.577350269189626 0.577350269189626)//11
    (-0.577350269189626 0.577350269189626 0.577350269189626)
    (-4.61880215351701 4.61880215351701 4.61880215351701)
    (-4.61880215351701 -4.61880215351701 4.61880215351701)
    (-0.577350269189626 -0.577350269189626 0.577350269189626)//15
);

blocks
(
    hex (3 2 5 4 11 10 13 12) (40 25 25) simpleGrading (50 1 1) // upper part
    hex (4 5 6 7 12 13 14 15) (40 25 25) simpleGrading (50 1 1) // equatorial part
    hex (7 6 1 0 15 14 9 8) (40 25 25) simpleGrading (50 1 1) // lower part
    hex (0 1 2 3 8 9 10 11) (40 25 25) simpleGrading (50 1 1) // equatorial part
    hex (0 1 6 7 3 2 5 4) (40 25 25) simpleGrading (50 1 1) // equatorial part
    hex (8 9 10 11 15 14 13 12) (40 25 25) simpleGrading (50 1 1) //equatorial part
);

edges
(
    arc 2 5 (0 5.65685424949238 -5.65685424949238)
    arc 5 6 (-5.65685424949238 0 -5.65685424949238)
    arc 5 13 (-5.65685424949238 5.65685424949238 0)
    
    arc 6 1 (0 -5.65685424949238 -5.65685424949238)
    arc 6 14 (-5.65685424949238 -5.65685424949238 0)

    arc 1 2 (5.65685424949238 0 -5.65685424949238)
    arc 1 9 (5.65685424949238 -5.65685424949238 0)

    arc 2 10 (5.65685424949238 5.65685424949238 0)

    arc 10 13 ( 0 5.65685424949238 5.65685424949238)
    arc 13 14 (-5.65685424949238 0 5.65685424949238)

    arc 14 9 (0 -5.65685424949238 5.65685424949238)
    arc 9 10 (5.65685424949238 0 5.65685424949238)

    arc 3 4 (0 0.707106781186547 -0.707106781186547)
    arc 4 7 (-0.707106781186547 0 -0.707106781186547)
    arc 7 0 (0 -0.707106781186547 -0.707106781186547)
    arc 0 3 (0.707106781186547 0 -0.707106781186547)
    arc 11 12 ( 0 0.707106781186547 0.707106781186547)
    arc 12 15 (-0.707106781186547 0 0.707106781186547)
    arc 15 8 (0 -0.707106781186547 0.707106781186547)
    arc 8 11 (0.707106781186547 0 0.707106781186547)
    arc 3 11 (0.707106781186547 0.707106781186547 0)
    arc 4 12 (-0.707106781186547 0.707106781186547 0)
    arc 7 15 (-0.707106781186547 -0.707106781186547 0)
    arc 0 8  (0.707106781186547 -0.707106781186547 0)
);

faces
(

    project (0 8 11 3) sphereIn
    project (3 11 12 4) sphereIn
    project (4 12 15 7) sphereIn
    project (7 15 8 0) sphereIn
    project (0 7 4 3) sphereIn
    project (8 11 12 15) sphereIn

    project (1 2 10 9) sphereOut 
    project (2 5 13 10) sphereOut
    project (5 6 14 13) sphereOut
    project (6 1 9 14) sphereOut
    project (1 2 5 6) sphereOut
    project (9 14 13 10) sphereOut
);

patches
(
    wall space
    (
        (1 2 10 9)
	(2 5 13 10)
	(5 6 14 13)
	(6 1 9 14)
	(1 2 5 6)
	(9 14 13 10)
    )
    wall interface
    (
	(0 8 11 3)
	(3 11 12 4)
	(4 12 15 7)
	(7 15 8 0)
	(0 7 4 3)
	(8 11 12 15)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
